"""
    对话机器人任务

        用来模拟人类对话或聊天的计算机程序, 接受人类的自然语言作为输入, 并给出合适的回复

    
    对话机器人的分类

        问答对话任务、任务型对话任务、检索问答任务、闲聊对话任务

    
    检索问答任务

        本质就是RAG任务, 让LLM能够基于外接向量数据库中的内容作为上下文, 结合用户查询来进行生成回复
    
    
    检索问答任务分类

        用户的查询和查询的回答(answer)进行匹配,  再返回匹配到的答案即可, 简称QA匹配
        注意这种方法有一个比较难的点：用户查询和该查询回答一般都不在同一个语义空间, 所有直接通过用户查询匹配到该查询的答案比较难
        也还是先将用户的查询和最为相似的候选问题进行匹配, 然后获取最为相似问题对应的答案进行匹配, 从而得到用户查询的答案


        用户的问题和候选问题进行匹配, 然后基于匹配到的最为相似候选问题的答案输出即可, 一般会使用这种方式, 检查QQ匹配


    生成式对话任务

        基于Decoder-only的模型来进行生成式任务

"""